fe40/tutorials/rheoEFoam/EKmixer/slipSmoluchowski/0/C.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inletWest
    {
	type            fixedValue;
	value           uniform 1;  
    }
    
    inletNorth
    {
	type            fixedValue;
	value           uniform 0; 
    }
    
    outlet
    {
	type            zeroGradient;  
    }
    
    symmetry
    {
	type            symmetryPlane;    
    }
    
    walls
    {
	type            zeroGradient;
    }
    
}

// ************************************************************************* //
