fe40/tutorials/rheoEFoam/EKmixer/slipSmoluchowski/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
                type            Newtonian;

                rho             rho [1 -3 0 0 0 0 0] 1000;
                eta             eta [1 -1 -1 0 0 0 0] .001; 
}

passiveScalarProperties
{
                solvePassiveScalar   yes;
                D                    D [ 0 2 -1 0 0 0 0 ] 2e-10; 
}

// ************************************************************************* //
